Revit 2026 API

# LocationPointPoint Property

---

The physical location of the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Point { get; set; }
```
```vb
Public Property Point As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Point : XYZ with get, set
```

#### Property Value

XYZ

Setting this property is not supported for some elements supporting LocationPoints, such as SpotDimensions.

#### Reference

LocationPoint Class

Autodesk.Revit.DB Namespace